#include<stdio.h>

int main(void)
{
	int a[5][5],b[26][3];
	int i,j,k,flag;
	k=1;//用于压缩矩阵中行列数及值的赋值 
	flag=0;//统计稀疏矩阵中元素个数
	
	//将原矩阵行列数赋给压缩矩阵
	//分别储存在压缩矩阵第一行第一列与第二列 
	*(*(b+0)+0)=5;
	*(*(b+0)+1)=5;
	
	for (i=0;i<5;i++)
	{
		for (j=0;j<5;j++)
		{
			scanf("%d",(*(a+i)+j)); 
		}
	} 
	
	//找到非零值就将其行列数及其值赋给压缩矩阵的相应位置
	//i为行数，j为列数 (从0开始） 
	for (i=0;i<5;i++)
	{
		for (j=0;j<5;j++)
		{
			if(*(*(a+i)+j)!=0)
			{
				*(*(b+k)+0)=i+1;
				*(*(b+k)+1)=j+1;
				*(*(b+k)+2)=*(*(a+i)+j);
				k++;
				flag++;//统计元素个数 
	    	}
      	}
    }
	
	*(*(b+0)+2)=flag;
	
	//打印表格 
	for (i=0;i<=flag;i++)
	//flag表示元素个数，i=flag则说明行数为（元素个数+原矩阵总行数值）打印结束
	//压缩矩阵b[26][3]后面的不用打印 
	{
		for (j=0;j<3;j++)
		{
			printf("%d ",*(*(b+i)+j));
			if (j==2)//如果列数等于3则跳行 
			{
				printf("\n");	
			}	
		}	
	}
	return 0;
}
